import Link from "next/link"

import Container from "@/components/ui/container"



const PrivacyPolicyPage = () => {
    return (
        <Container>
            <div className="w-full my-16">
                <h4 className="text-center text-lg uppercase font-bold">Үйлчилгээний нөхцөл</h4>
                <ul className="py-4">
                    <li>
                        <span className="text-m font-semibold">  
                            1. ЕРӨНХИЙ НӨХЦӨЛ
                        </span>
                        <ul className="list-disc pl-16 leading-6 main_gray font-sm my-4">
                            <li>Tsetsegtmendchilgee.mn нь Цэнтрополис ХХК албан ёсны вэб сайт бөгөөд энэхүү нөхцөл  нь уг вэбсайтаар үйлчлүүлэх, бараа бүтээгдэхүүн худалдан авахтай холбоотой үүсэх харилцааг зохицуулахад оршино.</li>
                            <li>
                            Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэб сайтаар үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсны үндсэн дээр хэрэгжинэ.
                            </li>
                            <li>Э​нэхүү үйлчилгээний нөх​цлийн хэрэгжилтэнд Цэнтрополис ХХК /цаашид Tsetsegtmendchilgee.mn гэх/ болон хэрэглэгч /цаашид захиалагч гэх/ хамтран хяналт тавина.
                            </li>
                        </ul>
                    </li>
                    <li>
                        <span className="text-m font-semibold">2. ҮЙЛ АЖИЛЛАГАА</span>
                        <ul className="list-disc pl-16 leading-6 main_gray font-sm my-4">
                            <li>Tsetsegtmendchilgee.mn  худалдааны тэмдэгтүүд нь Наран трэйд ХХК-ийн өмч бөгөөд энэхүү вэб сайтын лого, нэр бусад загварыг хуулах, олшруулах, дуурайх, өөр бусад ямар ч зүйлд ашиглахыг хориглоно.
                            </li>
                            <li>Барааны мэдээлэл, үнийн өөрчлөлт, хямдрал урамшууллын үнэн зөвийг компани бүрэн хариуцна.
                            </li>
                            <li>Захиалагч нь вэбсайтын талаар санал гомдол, шинэ санал, шүүмж зэргийг вэбийн журмын дагуу илэрхийлэх, илгээх эрхтэй.
                            </li>
                        </ul>
                    </li>
                    <li>
                        <span className="text-m font-semibold">3. ХЭРЭГЛЭГЧИЙН БҮРТГЭЛ</span>
                        <ul className="list-disc pl-16 leading-6 main_gray font-sm my-4">
                            <li>Захиалагчийн мэдээллийн бүрэн бүтэн болон үнэн зөв байдлыг байгууллага цаг тухай бүрт шалгаж байх ба хэрэглэгчийн мэдээллийн нууцлалыг байгууллага бүрэн хамгаална.
                            </li>
                            <li>
                            Захиалагчийн мэдээллийн үнэн зөв, бодит байдалд захиалагч бүрэн хариуцлага хүлээнэ.
                            </li>
                        </ul>
                    </li>
                    <li>
                        <span className="text-m font-semibold">4. ТӨЛБӨР ТООЦОО</span>
                        <ul className="list-disc pl-16 leading-6 main_gray font-sm my-4">
                            <li>
                            Сайтад байрлуулсан онлайн үнэ нь НӨАТ орсон жижиглэнгийн үнэ байна.
                            </li>
                            <li>
                            Tsetsegtmendchilgee.mn -ээс бараа бүтээгдэхүүн худалдан авахдаа заагдсан төлбөрийг 100% төлсний дараа захиалга баталгаажиж хүргэлт хийгдэнэ.
                            </li>
                            <li>
                            Төлбөр дутуу төлөгдсөн тохиолдолд хүргэлт хийгдэх боломжгүй.
                            </li>
                            <li>
                            Төлбөр нь илүү төлөгдсөн бол Tsetsegtmendchilgee.mn нь ажлын 3 өдөрт багтаан хэрэглэгчийн дансанд буцаан шилжүүлнэ.
                            </li>
                            <li>
                            Төлбөрийг дансаар, картаар, банк хоорондын шилжүүлгээр хийнэ.
                            </li>
                            <li>
                            Интернет доголдол, банкны үйл ажиллагаа, цахилгааны саатал, хэрэглэгчийн буруутай, алдаатай үйл ажиллагаанаас төлбөрийн асуудал гарсан тохиолдолд Tsetsegtmendchilgee.mn хариуцах боломжгүй.  
                            </li>
                        </ul>
                    </li>
                    <li>
                        <span className="text-m font-semibold">5. ХҮРГЭЛТ</span>
                        <ul className="list-disc pl-16 leading-6 main_gray font-sm my-4">
                            <li>
                            Tsetsegtmendchilgee.mn нь бараа захиалга баталгаажсаны дараа хүргэлтийг 4-8 цагийн дотор хүргэнэ. /Улаанбаатар хот дотор/
                            </li>
                            <li>
                            Захиалагч хүргэлтийн хаягтаа байгаагүйгээс үүдсэн давтан хүргэлтийг нэг удаа дахин хийх бөгөөд хүргэлтийн төлбөрийг захиалагч төлнө.
                            </li>
                            <li>
                            МУ-ын хуулиар бүх нийтийн амралт гэж заасан өдрүүдэд хүргэлт хийгдэхгүй.
                            </li>
                            <li>
                            Хүргэлтийг хэрэглэгчийн заасан хаягт, захиалсан бараа бүтээгдэхүүнийг хүргэнэ. Хүргэлтийн төлбөрийг <Link href="http://localhost:3000/delivery" target="_blank" className="underline text-red-500">Хүргэлтийн мэдээлэл</Link> -с харна уу.
                            </li>
                        </ul>
                    </li>
                    <li>
                        <span className="text-m font-semibold">8. БУСАД ЗААЛТ</span>
                        <ul className="list-disc pl-16 leading-6 main_gray font-sm my-4">
                            <li>
                            Худалдан авагчийн мэдээлэл болон төлбөрийн талаар ямар нэг асуудал эсвэл тодруулга гарвал вэбсайтын оператор хэрэглэгчийн утас /7734-7799/ эсвэл имэйл /info@tsetsegtmendchilgee.mn/ рүү холбогдож лавлагаа хийж болно.
                            </li>
                            <li>
                            Хэрэглэгчээс гарсан гомдол, маргаантай асуудлыг үйлчилгээний нөхцөл, нууцлалын баталгаа болон Монгол улсын холбогдох хууль тогтоомж, дүрэм журмын дагуу шийдвэрлэнэ.
                            </li>
                            <li>
                            Хэрэглэгч санал хүсэлт, асуулт, лавлагааг имэйл болон чат ашиглан мөн 7734-7799 утсаар холбогдож болно.
                            </li>
                        </ul>
                    </li>
                </ul>
            </div>
        </Container>
    )
}

export default PrivacyPolicyPage;